questions = [
    "什麼是光生伏打效應",
    "太陽能光電模組適用什麼材料製造的",
    "太陽能的發電效率大概多少",
    "太陽能發電有哪些類別",
    "全球太陽能光伏裝置量最多的前三個國家",
    "水力發電每單位電量所產生的二氧化碳為多少 g"
]

gts = [
    "簡稱為太陽能光電效應，是指受光線或其他電磁輻射照射的半導體或半導體與金屬組合的部位間產生電壓與電流的現象。",
    "由矽太陽能電池製造的。模組分為單晶矽、或多晶矽材料的模組。"
    "太陽能光電系統對太陽輻射能量的利用效率僅25%左右。",
    "主要分為直接轉換的光伏發電（PV）與間接轉換的聚光太陽能熱發電（CSP）兩大類別。"
    "中國、日本、德國",
    "水力發電每單位電量所產生的二氧化碳排放量為 4g CO2/kWhe"
]

gpt4o_questions = [
    "什麼是光生伏打效應？",
    "太陽能光電模組最常見的單塊發電量大約為多少瓦？",
    "太陽能光電模組的發電效率大約是多少？",
    "太陽能光電模組主要使用哪種材料製成？",
    "什麼是太陽能光電陣列（solar array）？",
    "太陽能發電主要分為哪兩種類型？",
    "2010至2020年間全球光伏發電成本下降了多少？",
    "太陽能電池將光轉換成電的原理是什麼？",
    "哪一項太陽能發電系統能透過儲熱實現最多24小時的發電？",
    "截至2017年，哪個國家太陽能光伏裝置容量最多？"
]

gpt4o_gts = [
    "光生伏打效應是指受光線或其他電磁輻射照射的半導體或半導體與金屬組合的部位間產生電壓與電流的現象。",
    "最常見的太陽能光電模組為60節設計，發電量約350至400瓦。",
    "太陽能光電系統對太陽輻射能量的利用效率約為25%。",
    "大部分太陽能光電模組是由矽太陽能電池製成，分為單晶矽與多晶矽材料。",
    "太陽能光電陣列是由多個太陽能光電模組互連組成的系統，用來擴大發電規模以供應商業大樓或住宅使用。",
    "太陽能發電主要分為光伏發電（PV）與聚光太陽能熱發電（CSP）兩大類別。",
    "下降了82%。",
    "利用光電效應，單個光子的能量被單個電子吸收產生電流。",
    "聚光太陽能發電系統。",
    "中國，以130,632百萬瓦（MW）居首。"
]
